<!DOCTYPE html>
<html>
 <head> 
 <title> Brukerhistorier </title>
  <link rel="stylesheet" type="text/css"
   href="felles.css" />
 </head>
<body>
<header> SoMe Akademiet </header>

 <ul class="topnav">
   <li><a href="index.html">Hjem</a></li>
   <li><a href="naomi.html">Naomis side</a></li>
   <li><a href="rebecca.html">Rebeccas side</a></li>
   <li><a href="persona.html">Persona</a></li>
   <li><a href="userstories.html">Brukerhistorier</a></li>
   <li><a href="systemutvikling.html">Systemutviklingsmetoder</a></li>
   <li><a href="agilemetoder.html">Agile metoder</a></li>
   <li><a href="gk.html">Gruppekontrakt</a></li>
 </ul>

 <h1>Agile systemutviklingsmetoder</h1>

 <div class="flex-container">
  <div>
   <br />
   Smidige eller agile systemutviklingsmetoder oppstod som et svar p&aring; behovet <br />
   for mer fleksible m&aring;ter &aring; utvikle programvare p&aring;. <br />
   Mange utviklere opplevde at tradisjonelle metodene, som fossefallsmodellen, <br />
   var for rigide og tidskrevende. <br />
   <br />
   I 2001 m&oslash;tes 17 erfarne utviklere i Utah i USA og utarbeidet The Agile Manifesto. <br />
   Dette manifestet ble grunnlaget for en ny m&aring;te &aring; tenke systemutvikling p&aring;, <br />
   hvor samarbeid, fleksibilitet og tilpasning st&aring;r i sentrum. <br />
   <br />
   Manifestet beskriver fire kjerneverdier: <br />
   1. Mennesker og samhandling er viktigere enn prosesser og verkt&oslash;y. <br />
   2. Fungerende programvare er viktigere enn omfattende dokumentasjon. <br />
   3. Samarbeid med kundene er viktigere enn kontraktsforhandlinger. <br />
   4. &Aring; reagere p&aring; endringer er viktigere enn &aring; f&oslash;lge en fast plan. <br />
   <br />
   Agile metoder legger opp til at systemutvikling skjer trinnvis, <br />
   i korte og repeterende faser. <br />
   I stedet for &aring; planlegge alt p&aring; forh&aring;nd, <br />
   jobber man i sm&aring; deler av gangen <br />
   og justere kursen underveis. <br />
   <br />
   Den mest kjente agile metoden er Scrum, <br />
   hvor teamet jobber i korte perioder kalt sprinter. <br />
   Hver sprint varer gjerne to til fire uker, <br />
   og etter hver periode evalueres resultatet sammen med kunden. <br />
   Dette gir kontinuering tilbakemelding og mulighet <br />
   til &aring; forbedre produktet underveis. <br />
   <br />
   Vi bruker agile metoder fordi de gj&oslash;r det mulig &aring; reagere raskt <br />
   p&aring; endringer og levere brukbare resultater tidligere i prosessen. <br />
   Kundene f&aring;r se konkrete produkter tidlig, <br />
   og utviklerne kan forbedre l&oslash;sningen fortl&oslash;pende. <br />
   Dette reduserer risikoen for at man ender opp med <br />
   et system som ikke passer til behovene. <br />
   <br />
   Styrkene ved agile metoder er fleksibilitet, tett samarbeid <br />
   og h&oslash;y motivasjon i teamet. <br />
   Feil blir oppdaget tidlig, og teamet l&aelig;rer <br />
   kontinuerlig av erfaringene sine. <br />
   <br />
   Samtidig har metodene ogs&aring; svakheter. <br />
   De krever mye kommunikasjon og tillit mellom alle involverte, <br />
   og det kan v&aelig;re vanskelig &aring; holde oversikten <br />
   i store og komplekse prosjekter. <br />
   <br />
   Til tross for dette er smidige metoder i dag  <br />
   de mest brukte tiln&aelig;rmingene i moderne systemutvikling. <br />
   De gir rom for kreativitet, samarbeid og tilpasning, <br />
   og s&oslash;rger for at sluttresultatet faktisk fungerer <br />
   for brukerne i virkelige situasjoner. <br />
   <br />
   <br />
   Kilde: <br />
   AI ble brukt for rettskriving og forbedring av spr&aring;k. <br />
   Alt faglig innhold er eget arbeid. <br />
   Har brukt PowerPoint fra forelesning. <br />
   <br />
  </div>
  </div>
  </p>
 



</body>
</html>