<!DOCTYPE html>
<html>
 <head> 
 <title> Brukerhistorier </title>
  <link rel="stylesheet" type="text/css"
   href="felles.css" />
 </head>
<body>
<header> SoMe Akademiet </header>

 <ul class="topnav">
   <li><a href="index.html">Hjem</a></li>
   <li><a href="naomi.html">Naomis side</a></li>
   <li><a href="rebecca.html">Rebeccas side</a></li>
   <li><a href="persona.html">Persona</a></li>
   <li><a href="userstories.html">Brukerhistorier</a></li>
   <li><a href="systemutvikling.html">Systemutviklingsmetoder</a></li>
   <li><a href="agilemetoder.html">Agile metoder</a></li>
   <li><a href="gk.html">Gruppekontrakt</a></li>
 </ul>

 <h1>Systemutviklingsmetoder</h1>

 <div class="flex-container">
   <div>
    <br />
     Systemutvikling handler om &aring; planlegge, utvikle og ta i bruk informasjonssystemer <br />
     p&aring; en m&aring;lrettet og organisert m&aring;te. <br />
     Et informasjonssystem best&aring;r av flere elementer som virker sammen: <br />
     maskinvare, programvare, data, prosedyrer og mennesker. <br />
     <br />
     M&aring;let er &aring; skape systemer som hjelper virksomheter <br />
     med &aring; samle, bearbeide og bruke informasjon effektivt. <br />
     For &aring; klare dette p&aring en strukturert m&aring;te brukes systemutviklingsmetoder, <br />
     som er rammeverk for hvordan utviklingsprosessen skal gjennomføres fra start til slutt. <br />
     &Aring; benytte en systemutviklingsmetode gir struktur, retningslinjer og kontroll i arbeidet. <br />
     Den beskriver hvilke steg man skal f&oslash;lge, hvordan oppgavene b&oslash;r utf&oslash;res <br />
     og hva som m&aring; v&aelig;re p&aring; plass f&oslash;r man g&aring;r videre til neste fase. <br />
     Dette bidrar til at prosjektet f&aring;r en tydelig plan, <br />
     og at alle som deltar vet hva som skal gj&oslash; res.
     <br />
     Det finnes mange ulike metoder, men de deles vanligvis inn i to hovedretninger: <br />
     strukturerte metoder og smidige (ogs&aring; kalt agile) metoder. <br />
     <br />
     Strukturerte metoder, slik som fossefallsmodellen, <br />
     bygger p&aring; en line&aelig;r prosess hvor utviklingen skjer trinn for trinn. <br />
     F&oslash;rst analyserer man behovene og definere kravene, <br />
     deretter f&oslash;lger design, utvikling, implementering og til slutt vedlikehold. <br />
     N&aring;r et trinn er ferdig, g&aring;r man videre til neste uten &aring; g&aring; tilbake. <br />
     Dette gir god oversikt og tydelig fremdrift, men lite fleksibilitet dersom noe m&aring; endres underveis. <br />
     <br />
     Fordelen med strukturerte metoder er at de passer godt for prosjekter med <br />
     tydelige krav og h&oslash;y kompleksitet, som i romfart, jernbane eller medisinsk teknologi. <br />
     Der er det viktig med n&oslash;yaktige standarder og trygghet for at alt skal fungere. <br />
     <br />
     Ulempen er at prosessen kan bli tung og lite tilpasningsdyktig. <br />
     Hvis kravene endres, kan det v&aelig;re b&aring;de kostbart <br />
     og tidskrevende &aring; rette opp feil. <br />
     Vi bruker systemutviklingsmetoder fordi de gir orden, kvalitet og bedre samarbeid. <br />
     Uten en metode kan prosjekter lett miste retning og bli uoversiktlige. <br />
     En metode hjelper teamet med &aring; planlegge ressursbruk, h&aring;ndtere risiko <br />
     og s&oslash;rge for at sluttproduktet faktisk dekker behovet. <br />
     <br />
     Selv om ingen metode passer alle prosjekter, er systematisk arbeid viktig <br />
     for å lykkes med utvikling av moderne informasjonssystemer.
     <br />
   </div>
  </div>
 